import trueskill as ts

class Ratings(dict):
    def __init__(self, players=[]):
        self.add_players(players)

    def add_players(self, players):
        for p in players:
            if p not in self:
                self[p] = ts.Rating()


class Tournament(object):
    def __init__(self, name, players):
        self._name = name
        self._players = players
        self._matches = []

    def add_match(self, p1, p2, res=1):
        if res < 0:
            self._matches.append((self._players[p2], self._players[p1], False))
        elif res == 0:
            self._matches.append((self._players[p1], self._players[p2], True))
        else:
            self._matches.append((self._players[p1], self._players[p2], False))

    def update_ratings(self, ratings):
        for (p1, p2, drawn) in self._matches:
            r1, r2 = ratings[p1], ratings[p2]
            r1, r2 = ts.rate_1vs1(r1, r2, drawn)
            ratings[p1], ratings[p2] = r1, r2


ratings = Ratings([
    'Петр Федин', 'Дмитрий Точенов', 'Алексей Смышляев', 'Павел Кузнецов',
    'Константин Кручинин', 'Владимир Владимирович', 'Никита Чикулаев',
    'Анна Мельникова', 'Денис Кубиков', 'Сергей Шевелев', 'Максим Федоров',
    'Евгений Сафронов', 'Александр Алексеев', 'Роман Евсеев',
    'Дмитрий Матвеев', 'Александр Петрив', 'Анатолий Коновалов',
    'Михаил Ковальков', 'Иван Марков', 'Максим Оргиец', 'Александр Оводков',
    'Святослав Соколов', 'Евгений Овчинников', 'Artur Diodand',
    'Антон Чичеткин', 'Данила Антонов', 'Ден Волк', 'Антон Коняхин',
    'Федор Федоренко', 'Евгений Климов', 'Виктор Нелипович',
    'Соёл Бадмацыренов', 'Александр Каревский', 'Денис Ульмаев', 'Марк Карк',
    'Максим Каревский', 'Мирон Андреев', 'Павел Аленчев', 'Виталий Тютюриков',
    'Михаил Соколов', 'Илья Кордонец', 'Алексей Купляков', 'Юлия Овчинникова',
    'Глеб Гусев', 'Давид Нариманидзе', 'Евгений Тюляев', 'Денис Никишин',
    'Александр Кутлин', 'YNot', 'Артем Анпилогов', 'Дмитрий Бондаренко',
    'Леонид Овчинников', 'Андрей Оводков', 'Александр Лебедев', 'Свежеватель',
    'Виталий Кривошеев', 'Алексей Меликянц', 'Максим Халилулин',
    'Антон Корнаков', 'Евгений Крамеров', 'Андрей Морозов', 'Стас Водолазский',
    'Дарион', 'Faraicool', 'Владимир Осокин', 'Nevar', 'Максим Яцык',
    'Максим Чередников', 'Алексей Павлов', 'Кронос', 'Кирилл Бадягин',
    'Ася Шестова', 'Василий Гущин', 'Степан Степанов', 'Григорий Архипов',
    'Полина Морозова'
])

tournaments = []

# TODO: The Mirror Showdown - II 15.10.2018 https://docs.google.com/spreadsheets/d/1Igwyt_zhfNlwKL7UMcBOYCVdzcAhp5Cfzkb_ueWN0gU/edit#gid=1317522882

# TODO: The Hunting Party - IX 24.12.2018 https://docs.google.com/spreadsheets/d/1xE529VWVc1zY3Sl1ck0f9jBFR2EqzpLWUSDOswMOX3Q/edit#gid=1317522882

t_2019_01_21 = Tournament(
    'The Mirror Showdown - III', {
        'НЧ': 'Никита Чикулаев',
        'РЕ': 'Роман Евсеев',
        'ЕС': 'Евгений Сафронов',
        'ДН': 'Денис Никишин',
        'ЕО': 'Евгений Овчинников',
        'ЮА': 'Юлия Овчинникова',
        'СШ': 'Сергей Шевелев',
        'ПК': 'Павел Кузнецов',
        'АП': 'Алексей Павлов',
        'СБ': 'Соёл Бадмацыренов',
        'АК': 'Анатолий Коновалов',
        'КК': 'Константин Кручинин',
        'ДТ': 'Дмитрий Точенов',
        'АД': 'Artur Diodand',
        'АС': 'Алексей Смышляев',
        'ФФ': 'Федор Федоренко',
        'ПФ': 'Петр Федин',
        'АМ': 'Андрей Морозов'
    })

# 1 тур
t_2019_01_21.add_match('РЕ', 'КК', -1)
t_2019_01_21.add_match('АК', 'АД', -1)
t_2019_01_21.add_match('ДН', 'ЮА', 1)
t_2019_01_21.add_match('ЕО', 'ЕС', -1)
t_2019_01_21.add_match('ПК', 'ФФ', 1)
t_2019_01_21.add_match('ПФ', 'АМ', 0)
t_2019_01_21.add_match('НЧ', 'АП', 1)
t_2019_01_21.add_match('АС', 'СБ', 0)
t_2019_01_21.add_match('ДТ', 'СШ', -1)
# 2 тур
t_2019_01_21.add_match('ПК', 'АД', -1)
t_2019_01_21.add_match('ДН', 'КК', -1)
t_2019_01_21.add_match('ЕС', 'СШ', 1)
t_2019_01_21.add_match('НЧ', 'АС', 1)
t_2019_01_21.add_match('ПФ', 'СБ', 1)
t_2019_01_21.add_match('АМ', 'ФФ', -1)
t_2019_01_21.add_match('АК', 'ЮА', 1)
t_2019_01_21.add_match('РЕ', 'ЕО', 1)
t_2019_01_21.add_match('ДТ', 'АП', 1)
# 3 тур
t_2019_01_21.add_match('КК', 'АД', 0)
t_2019_01_21.add_match('ЕС', 'НЧ', -1)
t_2019_01_21.add_match('ПФ', 'АК', 0)
t_2019_01_21.add_match('РЕ', 'ПК', -1)
t_2019_01_21.add_match('ДН', 'ДТ', -1)
t_2019_01_21.add_match('ФФ', 'СШ', 1)
t_2019_01_21.add_match('АС', 'АМ', 1)
t_2019_01_21.add_match('СБ', 'ЕО', 1)
# 4 тур
t_2019_01_21.add_match('НЧ', 'КК', -1)
t_2019_01_21.add_match('АД', 'ПФ', 1)
t_2019_01_21.add_match('ПК', 'ДТ', 1)
t_2019_01_21.add_match('ФФ', 'АК', 1)
t_2019_01_21.add_match('ЕС', 'АС', 1)
t_2019_01_21.add_match('РЕ', 'СБ', -1)
t_2019_01_21.add_match('ДН', 'СШ', -1)
t_2019_01_21.add_match('ЮА', 'АМ', 0)
# результаты
t_2019_01_21.update_ratings(ratings)
tournaments.append(t_2019_01_21)

# TODO: попробовать добавить командник 'Shadeglass Crusade': https://docs.google.com/spreadsheets/d/1rdY1WNSRE1moKqVWZMxHGJlBaxPiC02wa-Ko5BeRo5M/edit#gid=0

t_2019_03_31 = Tournament(
    'The Hunting Party - X', {
        'Ф': 'Константин Кручинин',
        'Н': 'Nevar',
        'ВВ': 'Владимир Владимирович',
        'НЧ': 'Никита Чикулаев',
        'ИМ': 'Иван Марков',
        'АК': 'Антон Корнаков',
        'МО': 'Максим Оргиец',
        'АлО': 'Александр Оводков',
        'АнО': 'Андрей Оводков',
        'АС': 'Алексей Смышляев',
        'МК': 'Михаил Ковальков',
        'АМ': 'Анна Мельникова',
        'ПФ': 'Петр Федин',
        'МА': 'Мирон Андреев'
    })

# 1 тур
t_2019_03_31.add_match('Ф', 'МА', 1)
t_2019_03_31.add_match('Н', 'ПФ', -1)
t_2019_03_31.add_match('НЧ', 'МК', 1)
t_2019_03_31.add_match('АМ', 'ВВ', 1)
t_2019_03_31.add_match('АС', 'ИМ', 1)
t_2019_03_31.add_match('АлО', 'МО', -1)
t_2019_03_31.add_match('АнО', 'АК', 0)
# 2 тур
t_2019_03_31.add_match('НЧ', 'ПФ', -1)
t_2019_03_31.add_match('АС', 'АМ', 1)
t_2019_03_31.add_match('Ф', 'МО', 1)
t_2019_03_31.add_match('Н', 'ИМ', -1)
t_2019_03_31.add_match('МК', 'АК', -1)
t_2019_03_31.add_match('ВВ', 'МА', 1)
t_2019_03_31.add_match('АнО', 'АлО', 1)
# 3 тур
t_2019_03_31.add_match('АС', 'Ф', -1)
t_2019_03_31.add_match('ПФ', 'АнО', 1)
t_2019_03_31.add_match('НЧ', 'АК', 1)
t_2019_03_31.add_match('АМ', 'ИМ', 0)
t_2019_03_31.add_match('ВВ', 'МО', 1)
t_2019_03_31.add_match('АлО', 'МК', 1)
t_2019_03_31.add_match('МА', 'Н', -1)
# результаты
t_2019_03_31.update_ratings(ratings)
tournaments.append(t_2019_03_31)

t_2019_04_15 = Tournament(
    'The Hunting Party - XI', {
        'КК': 'Константин Кручинин',
        'МК': 'Марк Карк',
        'ПМ': 'Полина Морозова',
        'ИМ': 'Иван Марков',
        'КБ': 'Кирилл Бадягин',
        'ВО': 'Владимир Осокин',
        'АО': 'Александр Оводков',
        'ВТ': 'Виталий Тютюриков'
    })

# 1 тур
t_2019_04_15.add_match('АО', 'ПМ', 1)
t_2019_04_15.add_match('ВТ', 'ИМ', -1)
t_2019_04_15.add_match('ВО', 'КБ', -1)
t_2019_04_15.add_match('МК', 'КК', 1)
# 2 тур
t_2019_04_15.add_match('ИМ', 'АО', 1)
t_2019_04_15.add_match('МК', 'КБ', 1)
t_2019_04_15.add_match('ВТ', 'ПМ', 1)
t_2019_04_15.add_match('ВО', 'КК', 1)
# 3 тур
t_2019_04_15.add_match('ИМ', 'МК', -1)
t_2019_04_15.add_match('АО', 'КК', -1)
t_2019_04_15.add_match('КБ', 'ВТ', -1)
t_2019_04_15.add_match('ПМ', 'ВО', -1)
# результаты
t_2019_04_15.update_ratings(ratings)
tournaments.append(t_2019_04_15)

t_2019_05_06 = Tournament(
    'The Hunting Party - XII', {
        'ДТ': 'Дмитрий Точенов',
        'ВВ': 'Владимир Владимирович',
        'Ф': 'Faraicool',
        'МХ': 'Максим Халилулин',
        'АП': 'Александр Петрив',
        'АО': 'Александр Оводков',
        'ДМ': 'Дмитрий Матвеев',
        'Си': 'Виктор Нелипович',
        'Кр': 'Кронос',
        'Св': 'Свежеватель',
        'Й': 'YNot',
        'СС': 'Святослав Соколов'
    })

# 1 тур
t_2019_05_06.add_match('ДТ', 'Й', 1)
t_2019_05_06.add_match('ВВ', 'Св', 1)
t_2019_05_06.add_match('Кр', 'Ф', 1)
t_2019_05_06.add_match('МХ', 'Си', -1)
t_2019_05_06.add_match('АП', 'ДМ', 1)
t_2019_05_06.add_match('АО', 'СС', -1)
# 2 тур
t_2019_05_06.add_match('Си', 'СС', -1)
t_2019_05_06.add_match('ДТ', 'АП', 1)
t_2019_05_06.add_match('ВВ', 'Кр', 1)
t_2019_05_06.add_match('АО', 'МХ', -1)
t_2019_05_06.add_match('Й', 'ДМ', -1)
t_2019_05_06.add_match('Св', 'Ф', -1)
# 3 тур
t_2019_05_06.add_match('СС', 'ВВ', 1)
t_2019_05_06.add_match('ДТ', 'Си', -1)
t_2019_05_06.add_match('МХ', 'АП', -1)
t_2019_05_06.add_match('ДМ', 'Ф', 1)
t_2019_05_06.add_match('Кр', 'Св', -1)
t_2019_05_06.add_match('АО', 'Й', 1)
# результаты
t_2019_05_06.update_ratings(ratings)
tournaments.append(t_2019_05_06)

#2019.05.27
t_2019_05_27 = Tournament(
    'The Mirror Showdown - IV', {
        'РЕ': 'Роман Евсеев',
        'АО': 'Александр Оводков',
        'СШ': 'Сергей Шевелев',
        'АП': 'Александр Петрив',
        'ДА': 'Данила Антонов',
        'ВВ': 'Владимир Владимирович',
        'ИМ': 'Иван Марков',
        'ЕК': 'Евгений Климов',
        'ДТ': 'Дмитрий Точенов',
        'ДУ': 'Денис Ульмаев',
        'МКа': 'Максим Каревский',
        'АКа': 'Александр Каревский',
        'АКу': 'Александр Кутлин',
        'ИК': 'Илья Кордонец',
        'СВ': 'Стас Водолазский',
        'МКо': 'Михаил Ковальков',
        'ПФ': 'Петр Федин',
        'ПА': 'Павел Аленчев',
        'МА': 'Мирон Андреев',
        'ВК': 'Виталий Кривошеев'
    })

# 1 тур
t_2019_05_27.add_match('РЕ', 'ЕК', 1)
t_2019_05_27.add_match('ВВ', 'АП', 1)
t_2019_05_27.add_match('АО', 'АКа', -1)
t_2019_05_27.add_match('СШ', 'ПФ', 0)
t_2019_05_27.add_match('ИМ', 'ИК', 1)
t_2019_05_27.add_match('ДТ', 'СВ', 1)
t_2019_05_27.add_match('ДУ', 'МКо', -1)
t_2019_05_27.add_match('ПА', 'МА', 1)
t_2019_05_27.add_match('ДА', 'ВК', 1)
t_2019_05_27.add_match('АКу', 'МКа', -1)
# 2 тур
t_2019_05_27.add_match('ДА', 'РЕ', -1)
t_2019_05_27.add_match('ИМ', 'МКа', -1)
t_2019_05_27.add_match('ВВ', 'ПА', 1)
t_2019_05_27.add_match('АКа', 'ДТ', -1)
t_2019_05_27.add_match('МКо', 'ПФ', -1)
t_2019_05_27.add_match('СШ', 'ДУ', 1)
t_2019_05_27.add_match('СВ', 'АО', -1)
t_2019_05_27.add_match('МА', 'АП', -1)
t_2019_05_27.add_match('АКу', 'ИК', 1)
t_2019_05_27.add_match('ЕК', 'ВК', 1)
# 3 тур
t_2019_05_27.add_match('МКа', 'РЕ', -1)
t_2019_05_27.add_match('ДТ', 'ВВ', 1)
t_2019_05_27.add_match('СШ', 'ДА', 1)
t_2019_05_27.add_match('ПФ', 'ЕК', 0)
t_2019_05_27.add_match('ИМ', 'АП', -1)
t_2019_05_27.add_match('ПА', 'АКа', -1)
t_2019_05_27.add_match('АКу', 'МКо', -1)
t_2019_05_27.add_match('АО', 'ВК', 1)
t_2019_05_27.add_match('ДУ', 'МА', -1)
t_2019_05_27.add_match('ИК', 'СВ', 0)
# 4 тур
t_2019_05_27.add_match('ДТ', 'РЕ', 1)
t_2019_05_27.add_match('СШ', 'МКа', 1)
t_2019_05_27.add_match('АП', 'МКо', 1)
t_2019_05_27.add_match('АКа', 'ПФ', -1)
t_2019_05_27.add_match('АО', 'ВВ', -1)
t_2019_05_27.add_match('ЕК', 'ДА', 1)
t_2019_05_27.add_match('ИМ', 'ПА', 1)
t_2019_05_27.add_match('МА', 'АКу', 1)
t_2019_05_27.add_match('ИК', 'ДУ', 1)
# результаты
t_2019_05_27.update_ratings(ratings)
tournaments.append(t_2019_05_27)

#2019.06.09
t_2019_06_09 = Tournament(
    'The Heroes Of The Vault', {
        'АС': 'Алексей Смышляев',
        'КК': 'Константин Кручинин',
        'ПФ': 'Петр Федин',
        'ДТ': 'Дмитрий Точенов',
        'СС': 'Святослав Соколов',
        'АО': 'Александр Оводков',
        'ЕК': 'Евгений Крамеров',
        'ВГ': 'Василий Гущин'
    })

# 1 тур
t_2019_06_09.add_match('АС', 'СС', 1)
t_2019_06_09.add_match('АО', 'ПФ', -1)
t_2019_06_09.add_match('КК', 'ЕК', 1)
t_2019_06_09.add_match('ВГ', 'ДТ', 0)
# 2 тур
t_2019_06_09.add_match('КК', 'ПФ', 1)
t_2019_06_09.add_match('АС', 'ДТ', 1)
t_2019_06_09.add_match('ВГ', 'СС', -1)
t_2019_06_09.add_match('АО', 'ЕК', 1)
# 3 тур
t_2019_06_09.add_match('КК', 'АС', -1)
t_2019_06_09.add_match('СС', 'ПФ', -1)
t_2019_06_09.add_match('ДТ', 'АО', 1)
t_2019_06_09.add_match('ВГ', 'ЕК', -1)
# результаты
t_2019_06_09.update_ratings(ratings)
tournaments.append(t_2019_06_09)

#2019.06.24
t_2019_06_24 = Tournament(
    'The Hunting Party - XIII', {
        'СШ': 'Сергей Шевелев',
        'ВВ': 'Владимир Владимирович',
        'АС': 'Алексей Смышляев',
        'ИМ': 'Иван Марков',
        'ПА': 'Павел Аленчев',
        'ДМ': 'Дмитрий Матвеев',
        'ДУ': 'Денис Ульмаев',
        'ПФ': 'Петр Федин',
        'АЛ': 'Александр Лебедев',
        'ДА': 'Дарион'
    })

# 1 тур
t_2019_06_24.add_match('ПА', 'ПФ', 1)
t_2019_06_24.add_match('СШ', 'АС', 1)
t_2019_06_24.add_match('ИМ', 'АЛ', 1)
t_2019_06_24.add_match('ВВ', 'ДМ', 0)
t_2019_06_24.add_match('ДУ', 'ДА', 1)
# 2 тур
t_2019_06_24.add_match('ИМ', 'ДУ', 1)
t_2019_06_24.add_match('СШ', 'ПА', 1)
t_2019_06_24.add_match('ВВ', 'АЛ', 1)
t_2019_06_24.add_match('ДМ', 'ДА', 1)
t_2019_06_24.add_match('АС', 'ПФ', 1)
# 3 тур
t_2019_06_24.add_match('ИМ', 'СШ', -1)
t_2019_06_24.add_match('ВВ', 'ДУ', 1)
t_2019_06_24.add_match('ДМ', 'АС', -1)
t_2019_06_24.add_match('ПА', 'АЛ', 1)
t_2019_06_24.add_match('ДА', 'ПФ', -1)
# результаты
t_2019_06_24.update_ratings(ratings)
tournaments.append(t_2019_06_24)

#2019.07.15
t_2019_07_15 = Tournament(
    'The Storming of The Mirrored City', {
        'РЕ': 'Роман Евсеев',
        'ПФ': 'Петр Федин',
        'ПК': 'Павел Кузнецов',
        'ГГ': 'Глеб Гусев',
        'МО': 'Максим Оргиец',
        'ДН': 'Давид Нариманидзе',
        'ИМ': 'Иван Марков',
        'ЕТ': 'Евгений Тюляев',
        'ДК': 'Денис Кубиков',
        'ДТ': 'Дмитрий Точенов',
        'АМ': 'Анна Мельникова',
        'СС': 'Святослав Соколов'
    })

# 1 тур
t_2019_07_15.add_match('ПК', 'ГГ', 0)
t_2019_07_15.add_match('РЕ', 'ЕТ', 1)
t_2019_07_15.add_match('ПФ', 'МО', 1)
t_2019_07_15.add_match('ДН', 'СС', -1)
t_2019_07_15.add_match('ИМ', 'АМ', -1)
t_2019_07_15.add_match('ДТ', 'ДК', 1)
# 2 тур
t_2019_07_15.add_match('СС', 'ДТ', 1)
t_2019_07_15.add_match('РЕ', 'ПФ', -1)
t_2019_07_15.add_match('ПК', 'АМ', 1)
t_2019_07_15.add_match('ДН', 'ГГ', 0)
t_2019_07_15.add_match('ДК', 'ЕТ', 1)
t_2019_07_15.add_match('МО', 'ИМ', 1)
# 3 тур
t_2019_07_15.add_match('СС', 'ПФ', -1)
t_2019_07_15.add_match('ПК', 'ДТ', 1)
t_2019_07_15.add_match('ДК', 'РЕ', -1)
t_2019_07_15.add_match('МО', 'АМ', -1)
t_2019_07_15.add_match('ДН', 'ИМ', 0)
# результаты
t_2019_07_15.update_ratings(ratings)
tournaments.append(t_2019_07_15)

'''
t_ = Tournament(
    '', {
        '': '',
        '': ''
    })

# 1 тур
t_.add_match('', '', )
t_.add_match('', '', )
t_.add_match('', '', )
t_.add_match('', '', )
# 2 тур
t_.add_match('', '', )
t_.add_match('', '', )
t_.add_match('', '', )
t_.add_match('', '', )
# 3 тур
t_.add_match('', '', )
t_.add_match('', '', )
t_.add_match('', '', )
t_.add_match('', '', )
# результаты
t_.update_ratings(ratings)
tournaments.append(t_)
'''

for p, r in sorted(ratings.items(), key=lambda pr: -pr[1].mu):
    print(p, r.mu, r.sigma)